src/Catalogs/ЭД_ЗначенияАналитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ЭД_ЗначенияАналитик</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>ChartOfCharacteristicTypes.ЭД_ТипыАналитик</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Свойство1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭД_ЗначенияАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Свойство2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭД_ЗначенияАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Свойство3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭД_ЗначенияАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Свойство4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭД_ЗначенияАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Свойство5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭД_ЗначенияАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоСтрока1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоСтрока2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоСтрока3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоСтрока4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоСтрока5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоБулево1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоБулево2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоБулево3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоБулево4</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоБулево5</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоДата1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоДата2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоДата3</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоДата4</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоДата5</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ЭД_Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ЭД_Периодичность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДваГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТриГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПятьЛет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ЭД_ЗначенияАналитик/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ ВЫПОЛНЯЕМЫЕ НА Сервере

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	КоличествоСвойств = ЭД_ОбщегоНазначения.ПолучитьКоличествоСвойств();
	
	Для Ин = 1 По КоличествоСвойств Цикл  		
		Если ЗначениеЗаполнено(Объект.Владелец["ИмяСвойства" + Ин]) Тогда 			
			Элементы["Свойство" + Ин].Заголовок = Объект.Владелец["ИмяСвойства" + Ин];
			Элементы["Свойство" + Ин].Видимость = Истина;  		
			
			НовыйПараметр 	= Новый ПараметрВыбора("Отбор.Владелец", Объект.Владелец["ТипСвойства" + Ин]);
			НовыйМассив 	= Новый Массив();
			
			НовыйМассив.Добавить(НовыйПараметр);
			НовыеПараметры 	= Новый ФиксированныйМассив(НовыйМассив);
			Элементы["Свойство" + Ин].ПараметрыВыбора = НовыеПараметры;
		
		КонецЕсли; 	
		
		Если ЗначениеЗаполнено(Объект.Владелец["ИмяСвойстваСтрока" + Ин]) Тогда 			
			Элементы["СвойствоСтрока" + Ин].Заголовок = Объект.Владелец["ИмяСвойстваСтрока" + Ин];
			Элементы["СвойствоСтрока" + Ин].Видимость = Истина;  			
		КонецЕсли; 		
		
		Если ЗначениеЗаполнено(Объект.Владелец["ИмяСвойстваБулево" + Ин]) Тогда 			
			Элементы["СвойствоБулево" + Ин].Заголовок = Объект.Владелец["ИмяСвойстваБулево" + Ин];
			Элементы["СвойствоБулево" + Ин].Видимость = Истина;  			
		КонецЕсли; 		
		
		Если ЗначениеЗаполнено(Объект.Владелец["ИмяСвойстваДата" + Ин]) Тогда 			
			Элементы["СвойствоДата" + Ин].Заголовок = Объект.Владелец["ИмяСвойстваДата" + Ин];
			Элементы["СвойствоДата" + Ин].Видимость = Истина;  			
		КонецЕсли; 		
	КонецЦикла;	
	
	Если Объект.Владелец = ПланыВидовХарактеристик.ЭД_ТипыАналитик.Периоды Тогда
		
		Элементы.Периодичность.Видимость 				= Истина;
		Если Объект.Ссылка.Пустая() Тогда
			Элементы.ДатаНачала.ОтметкаНезаполненного 		= Истина;
			Элементы.ДатаОкончания.ОтметкаНезаполненного 	= Истина;
			Элементы.Периодичность.ОтметкаНезаполненного 	= Истина;
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры	


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ НА Сервере

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Элементы.Код.Маска = Объект.Владелец.МаскаКодаЗначения;
	КонецЕсли;	
	
	УстановитьВидимостьЭлементов(); 
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.Владелец = ПланыВидовХарактеристик.ЭД_ТипыАналитик.Периоды Тогда
		Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
	        Сообщение = Новый СообщениеПользователю();
	        Сообщение.Текст = "Не заполнена дата начала";
	        Сообщение.Поле = "Объект.ДатаНачала";
	        Сообщение.УстановитьДанные(Объект.ДатаНачала);
	        Сообщение.Сообщить();
	        Отказ = Истина;
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
	        Сообщение = Новый СообщениеПользователю();
	        Сообщение.Текст = "Не заполнена дата окончания";
	        Сообщение.Поле = "Объект.ДатаОкончания";
	        Сообщение.УстановитьДанные(Объект.ДатаОкончания);
	        Сообщение.Сообщить();
	        Отказ = Истина;
		КонецЕсли;	  		
		
		Если Не ЗначениеЗаполнено(Объект.Периодичность) Тогда
	        Сообщение = Новый СообщениеПользователю();
	        Сообщение.Текст = "Не заполнена периодичность";
	        Сообщение.Поле = "Объект.Периодичность";
	        Сообщение.УстановитьДанные(Объект.Периодичность);
	        Сообщение.Сообщить();
	        Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;	     	
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура СинхронизироватьДатыПериодичность(ДатаНачала, ДатаОкончания, Периодичность, Наименование)
	
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = ?(ЗначениеЗаполнено(ДатаОкончания), ДатаОкончания, ТекущаяДата());
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Периодичность) Тогда
		Если Периодичность = Перечисления.ЭД_Периодичность.Год Тогда
			ДатаНачала	 = НачалоГода(ДатаНачала);
			ДатаОкончания = КонецГода(ДатаНачала);
		ИначеЕсли Периодичность = Перечисления.ЭД_Периодичность.Полугодие Тогда
			Если Месяц(ДатаНачала) <= 6 Тогда
				ДатаНачала	 = НачалоГода(ДатаНачала);
			Иначе	
				ДатаНачала	 = ДобавитьМесяц(НачалоГода(ДатаНачала), 6);
			КонецЕсли;	
			ДатаОкончания = КонецГода(ДатаНачала);
		ИначеЕсли Периодичность = Перечисления.ЭД_Периодичность.Квартал Тогда
			ДатаНачала	 	= НачалоКвартала(ДатаНачала);
			ДатаОкончания 	= КонецКвартала(ДатаНачала);
		ИначеЕсли Периодичность = Перечисления.ЭД_Периодичность.Месяц Тогда
			ДатаНачала	 	= НачалоМесяца(ДатаНачала);
			ДатаОкончания 	= КонецМесяца(ДатаНачала);
		ИначеЕсли Периодичность = Перечисления.ЭД_Периодичность.Неделя Тогда
			ДатаНачала	 	= Макс(НачалоНедели(ДатаНачала), НачалоГода(ДатаНачала));
			ДатаОкончания 	= Мин(КонецНедели(ДатаНачала), КонецГода(ДатаНачала));
		ИначеЕсли Периодичность = Перечисления.ЭД_Периодичность.День Тогда
			ДатаОкончания 	= ДатаНачала;
		ИначеЕсли Периодичность = Перечисления.ЭД_Периодичность.ДваГода Тогда
			ДатаНачала	 	= НачалоГода(ДатаНачала);
			ДатаОкончания 	= ДобавитьМесяц(КонецГода(ДатаНачала), 12);
		ИначеЕсли Периодичность = Перечисления.ЭД_Периодичность.ТриГода Тогда
			ДатаНачала	 	= НачалоГода(ДатаНачала);
			ДатаОкончания 	= ДобавитьМесяц(КонецГода(ДатаНачала), 24);
		ИначеЕсли Периодичность = Перечисления.ЭД_Периодичность.ПятьЛет Тогда
			ДатаНачала	 	= НачалоГода(ДатаНачала);
			ДатаОкончания 	= ДобавитьМесяц(КонецГода(ДатаНачала), 48);
		Иначе	
			ДатаНачала	 	= НачалоГода(ТекущаяДата());
			ДатаОкончания 	= КонецГода(ДатаНачала);
		КонецЕсли;	
	КонецЕсли;	
	
	Наименование = ЭД_ОбщегоНазначения.СформироватьНаименованиеПериода(Периодичность, ДатаНачала, ДатаОкончания);
	
	
КонецПроцедуры	


&НаСервереБезКонтекста
Процедура ДатаНачалаПриИзмененииСервер()
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	СинхронизироватьДатыПериодичность(Объект.ДатаНачала, Объект.ДатаОкончания, Объект.Периодичность, Объект.Наименование);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	СинхронизироватьДатыПериодичность(Объект.ДатаНачала, Объект.ДатаОкончания, Объект.Периодичность, Объект.Наименование);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	СинхронизироватьДатыПериодичность(Объект.ДатаНачала, Объект.ДатаОкончания, Объект.Периодичность, Объект.Наименование);
	
КонецПроцедуры
